<a href="https://colab.research.google.com/github/ChoSuhyun/-/blob/main/python(1.14).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('./data.csv',encoding='cp949')

In [4]:
df.count()

지역명        4590
규모구분       4590
연도         4590
월          4590
분양가격(㎡)    4276
dtype: int64

In [5]:
df.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [6]:
df.iloc[2, 1]

'전용면적 60㎡초과 85㎡이하'

In [7]:
df.iloc[2, :]

지역명                      서울
규모구분       전용면적 60㎡초과 85㎡이하
연도                     2015
월                        10
분양가격(㎡)                5882
Name: 2, dtype: object

In [8]:
df[df['연도'] == 2019][:5]

     지역명               규모구분    연도  월 분양가격(㎡)
3315  서울                 전체  2019  1    7600
3316  서울         전용면적 60㎡이하  2019  1    7400
3317  서울   전용면적 60㎡초과 85㎡이하  2019  1    8105
3318  서울  전용면적 85㎡초과 102㎡이하  2019  1    6842
3319  서울        전용면적 102㎡초과  2019  1    7787

In [9]:
df.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [10]:
df.loc[df['지역명']=='서울','지역명'][:10]

0     서울
1     서울
2     서울
3     서울
4     서울
85    서울
86    서울
87    서울
88    서울
89    서울
Name: 지역명, dtype: object

In [11]:
df.loc[df['지역명']=='서울','지역명'] = 'Seoul'

In [12]:
df.head

<bound method NDFrame.head of         지역명               규모구분    연도   월 분양가격(㎡)
0     Seoul                 전체  2015  10    5841
1     Seoul         전용면적 60㎡이하  2015  10    5652
2     Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882
3     Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721
4     Seoul        전용면적 102㎡초과  2015  10    5879
...     ...                ...   ...  ..     ...
4585     제주                 전체  2020   3    3955
4586     제주         전용면적 60㎡이하  2020   3    4039
4587     제주   전용면적 60㎡초과 85㎡이하  2020   3    3962
4588     제주  전용면적 85㎡초과 102㎡이하  2020   3     NaN
4589     제주        전용면적 102㎡초과  2020   3    3601

[4590 rows x 5 columns]>

In [14]:
df1 = df.reindex(index=df.index[:7], columns=list(df.columns) + ['extra'])
df1

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841    NaN
1  Seoul         전용면적 60㎡이하  2015  10    5652    NaN
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882    NaN
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721    NaN
4  Seoul        전용면적 102㎡초과  2015  10    5879    NaN
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [16]:
df2 = df1.copy()
df2

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841    NaN
1  Seoul         전용면적 60㎡이하  2015  10    5652    NaN
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882    NaN
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721    NaN
4  Seoul        전용면적 102㎡초과  2015  10    5879    NaN
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [19]:
df2.loc[:5,'extra']=False

In [20]:
df2

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163  False
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [21]:
df3=df1.copy()
df3

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841    NaN
1  Seoul         전용면적 60㎡이하  2015  10    5652    NaN
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882    NaN
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721    NaN
4  Seoul        전용면적 102㎡초과  2015  10    5879    NaN
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [22]:
df2.fillna(value=True)

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163  False
6     인천         전용면적 60㎡이하  2015  10    3488   True

# **3. NaN 값이 있는 데이터를 Boolean 값으로 출력**

In [23]:
pd.isna(df2) #non인지 아닌지 판별

     지역명   규모구분     연도      월  분양가격(㎡)  extra
0  False  False  False  False    False  False
1  False  False  False  False    False  False
2  False  False  False  False    False  False
3  False  False  False  False    False  False
4  False  False  False  False    False  False
5  False  False  False  False    False  False
6  False  False  False  False    False   True

# 연산

In [24]:
df.head()

     지역명               규모구분    연도   월 분양가격(㎡)
0  Seoul                 전체  2015  10    5841
1  Seoul         전용면적 60㎡이하  2015  10    5652
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  Seoul        전용면적 102㎡초과  2015  10    5879

In [25]:
df.mean() #분양가는 non값이 존재해 뜨기 않음.

연도    2017.5
월        6.5
dtype: float64

In [28]:
df.mean(1)[:5]#0은 칼럼/열 기준,1은 행기준

0    1012.5
1    1012.5
2    1012.5
3    1012.5
4    1012.5
dtype: float64

In [30]:
df.shift(2)[:5] # 앞에서부터 2칸밀기

     지역명              규모구분      연도     월 분양가격(㎡)
0    NaN               NaN     NaN   NaN     NaN
1    NaN               NaN     NaN   NaN     NaN
2  Seoul                전체  2015.0  10.0    5841
3  Seoul        전용면적 60㎡이하  2015.0  10.0    5652
4  Seoul  전용면적 60㎡초과 85㎡이하  2015.0  10.0    5882

In [31]:
df.shift(-2)[:5]

     지역명               규모구분      연도     월 분양가격(㎡)
0  Seoul   전용면적 60㎡초과 85㎡이하  2015.0  10.0    5882
1  Seoul  전용면적 85㎡초과 102㎡이하  2015.0  10.0    5721
2  Seoul        전용면적 102㎡초과  2015.0  10.0    5879
3     인천                 전체  2015.0  10.0    3163
4     인천         전용면적 60㎡이하  2015.0  10.0    3488

# Broadcasting을 이용한 subtract (빼기)

In [33]:
df1 = df[['연도', '월']]
df1.head()

     연도   월
0  2015  10
1  2015  10
2  2015  10
3  2015  10
4  2015  10

In [35]:
df1

        연도   월
0     2015  10
1     2015  10
2     2015  10
3     2015  10
4     2015  10
...    ...  ..
4585  2020   3
4586  2020   3
4587  2020   3
4588  2020   3
4589  2020   3

[4590 rows x 2 columns]

In [34]:
df1.shape #(row,colume)하나의 리스트로

(4590, 2)

In [36]:
s = np.ones(df.shape[0]) #one을 하면 모든 원소를1을 넣은 array를 만듬,zero를 하면 0 np로 array로 바꿈과 동시에,
s.shape

(4590,)

In [37]:
s

array([1., 1., 1., ..., 1., 1., 1.])

In [38]:
df1.sub(s, axis=0).head()

       연도    월
0  2014.0  9.0
1  2014.0  9.0
2  2014.0  9.0
3  2014.0  9.0
4  2014.0  9.0

In [39]:
df1.sub(s*3, axis=0).head() #*3은 1에서3을 곱해 빼고싶은 만큼.
#axis=0은 위에서 순서, 1은 가로순서,,,

       연도    월
0  2012.0  7.0
1  2012.0  7.0
2  2012.0  7.0
3  2012.0  7.0
4  2012.0  7.0

In [42]:
s = np.ones(df1.shape[1])
s

array([1., 1.])

In [43]:
df1.sub(s, axis=1).head()

       연도    월
0  2014.0  9.0
1  2014.0  9.0
2  2014.0  9.0
3  2014.0  9.0
4  2014.0  9.0

# Apply
# np.cumsum : cumulative sum의 함수형으로 누적 합을 구하는 함수

In [44]:
df1.apply(np.cumsum)[:10]

      연도    월
0   2015   10
1   4030   20
2   6045   30
3   8060   40
4  10075   50
5  12090   60
6  14105   70
7  16120   80
8  18135   90
9  20150  100

In [45]:
df1

        연도   월
0     2015  10
1     2015  10
2     2015  10
3     2015  10
4     2015  10
...    ...  ..
4585  2020   3
4586  2020   3
4587  2020   3
4588  2020   3
4589  2020   3

[4590 rows x 2 columns]

In [46]:
df1.apply(lambda x: x.max() - x.min()) #apply 모든 변수에 동일 함수 적용
#x.max() 는 최대값인 12 x.min() 은 최소값인 1

연도     5
월     11
dtype: int64

# 값들의 종류별 출력

In [47]:
df1['연도'].value_counts() #칼럼의 갯수

2019    1020
2018    1020
2017    1020
2016    1020
2015     255
2020     255
Name: 연도, dtype: int64

In [48]:
df1['월'].value_counts()

11    425
3     425
10    425
2     425
1     425
12    425
7     340
6     340
9     340
5     340
8     340
4     340
Name: 월, dtype: int64